<picture><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 



<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>O03-NI-GCP</td>

<td align="center"><picture><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img  width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>src</td>

<td>UDP on all ports can exit your network to Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>src</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img  width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  O03-NI-GCP</summary> 

### **Title:**
UDP on all ports can exit your network to Private IPs

### **Description:**
Allowing UDP on all ports to exit your network is extremely risky since this includes many vulnerable services.  The largest threat is that of Trojan horses contacting their controllers, followed by unintended information leakage, and spreading of malicious code like viruses and worms.

### **Recommendation:**
Review all the rules that allow outbound traffic with 
UDP on all ports, and limit them to those services you 
actually require by deploying a stateful firewall for outbound traffic.

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>undefined</td>

  <td>undefined</td>

  <td>udp</td>

  <td></td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.o03-ni-gcp will be created
  + resource "google_compute_firewall" "o03-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "devsecops-fw-single-ip-egress"
      + network            = "devsecops-network-gcp"
      + priority           = 2300
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = 1460
      + name                            = "devsecops-network-gcp"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\tmp\src.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/src\\tmp\\src.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @elad-algosec<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD